cases/ansys_verification/VMFL051/case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

// rhoCentralFoam is explicit in the convective fluxes; with mu = 0 (inviscid)
// the diffusive correctors U and h are never invoked, but the entries are kept
// so the dictionary is complete and the case is portable to a viscous variant.

solvers
{
    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-09;
        relTol          0.01;
    }

    h
    {
        $U;
        tolerance       1e-10;
        relTol          0;
    }
}
